# RevitServerModelNameBreaksConventionException Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitServerModelNameBreaksConventionException Class
Members See Also
---
The exception that is thrown when the model is breaking the project naming convention.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
[SerializableAttribute]
public class RevitServerModelNameBreaksConventionException : RevitServerException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class RevitServerModelNameBreaksConventionException _
	Inherits RevitServerException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class RevitServerModelNameBreaksConventionException : public RevitServerException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..RevitServerException Autodesk.Revit.Exceptions..::..RevitServerModelNameBreaksConventionException
# See Also
RevitServerModelNameBreaksConventionException Members
Autodesk.Revit.Exceptions Namespace